package java0103;

public class BitLogic {

	public static void main(String[] args) {
		int a = 20;
		int b = 13;
		/*
		 * a : [0000 0000][0000 0000][0000 0000][0001 0100]
		 * b : [0000 0000][0000 0000][0000 0000][0000 1101]
		 */
		
		// 2개 모두 1인 경우만 1
		// [0000 0000][0000 0000][0000 0000][0000 0100]
		System.out.println("a & b : " + (a&b));
		// 4 출력
		
		// 2개 모두 0인 경우에만 0 나머지 경우는 1
		//[0000 0000][0000 0000][0000 0000][0001 1101]
		System.out.println("a & b : " + (a|b));
		// 29 출력
		
		// 2개 모두 같으면 0, 다르면 1
		//[0000 0000][0000 0000][0000 0000][0001 1001]
		System.out.println("a & b : " + (a^b));
		// 25 출력

	}

}
 